#!/usr/bin/python
# -*-coding: utf-8 -*-
import gspread
import os
import re
import random
import fileinput
from datetime import datetime
import json
import time
import sys
from random import randint
if len(sys.argv) < 2:
    sys.exit(0)

#message = "Debugging "
message = sys.argv[1]
#print (message)
now = datetime.now()
result = ''
from oauth2client.service_account import ServiceAccountCredentials
from linebot import LineBotApi
from linebot.models import TextSendMessage
from linebot.exceptions import LineBotApiError

groupdelc = 'Cc7000940b2553b969f0ab5f3ca22886e'
line_bot_api = LineBotApi('Q8BjDP5iRdj+FprSJXxyDk95z358K0355D7rTRTBuubd0z+0XFTanFHD+yPyR7uAIOKtdpbtv99HxxSgm49QEOxmYI/PrA5Hlt3l4TYVVoxPYPYRS4G/7eVMr8YldmlybqUabhXknXephfGwzB1GXgdB04t89/1O/w1cDnyilFU=')
status = 0
share = ['แชร','ประชาสัมพัน','ประกาศ','ส่งต่อ','บอกต่อ','ปชส','ร่วมบุญ','ได้บุญ','บอกบุญ']
musthave = ['อจ.','อาจารย์','teacher','ศึกษา','ภาษา','วิชา','นส','หนังสือ','กระเว็ต' ,'กรีก','กรูซินิก','กวาตาบาอิก','กวาเบียว','กวารา','กอกโบรอก','ก๊อง','กอตต์','กอน','กอนกานี','กอย ซันจัก ซูรัต','กะโจ','กะเซง','กะดู','กะเดา','กะโด','กะตัว','กะตาง','กะตูตะวันตก','กะตูตะวันออก','กะยัน','กะยา','กะยาตะวันออก','กะโยง','กะเหรี่ยง','กเปลเล','กัง','กังเต','กัจฉิ','กันตู','กันนาดา','กัมกาตา-วิรี','กัมเบอรา','กัว','กัวรานี','กากาอุซ','กาตา โกโลก','กาเนาชี','กาบาร์เดีย','กาปัมปางัน','กาปิซนอน','กามาโย','กาโย','การากัลปัก','การาเชย์ ปัลกา','กาลาซาอลา','กาลาเทีย','กาลูยานอน','กายลา','กาวาลัน','กาสี','กินาคิ','กินาไรอา','กินตัก','กินเนารี','กิมมุน','กิออร์','กุมซารี','กุย','กุรุข','กูกอง','กูรุง','เกมัก','เกเลา','เกาลาน','เกรียง','เกวียงใต้','เกวียงเหนือ','เกาหลี','โกตา','โกทวะ','โกมัส','โกมี','โกรล','โกฮิสถาน','โกโฮ','ขมุ','ข่าตองเหลือง','ขาริโพลี','เขมร','เขมรลาวเดิม','เขมรเหนือ','คริสตัง','ครี','ครีโอลมาเก๊า','คลอร์','ควาซไคว','คอเรีย','คังเจีย','คัว','คากัส','ค้าง','คาซัค','คาซาร์','คาตาลานิก','คาม','คาเรีย','คาไรม์','คาลมึกซ์','คาลาซ','คาวาร์-บาตี','คาวาเรสเมียร์','คำยัง','คิเลกิ','คีตัน','คีร์กิซ','คุชราต','คูมี','คูมี อวา','เคา','เคิร์ด','เครียมชาก','เคือน','แคชเมียร์','โคกูรยอ','โควาร์','โคโอง','งวน','งาลา','เงาน์','จรู','จเรา','จ้วง','จอร์เจีย','จะต็อง','จาม','จาราย','จิ่งโป','จิตตะกอง','จีน','จีนกลาง','จีนกวางตุ้ง','จีนฮกเกี้ยน','จูร์เชน','เจ็ง','เจะห์','เจ๊ะเห','เจียรง','ฉัตตีสครห์','ชวงทา','ชวา','ชอง','ชองส์ซันเมอร์','ชะกะไต','ชัก','ชันเตียล','ชัวดิช','ชาบากาโน','ชินบอน','ชุต','ชูเลียม','ชูวาส','เชก-วอง','เชเชน','เชอโรกี','ซรี','ซอกเดีย','ซองคา','ซังกิซารี','ซัมบัล','ซากา','ซาไก','ซาคา','ซาซัก','ซาบาอิก','ซาบาเอียน','ซาปวน','ซาร์ฟาติก','ซาไฟติก','ซามาริทัน','ซาริโกลี','ซาลาร์','ซาอารัว','ซาโอช','ซิเดติก','ซินาติก','ซินี','ซิเบ','ซีรีแอก','ซุกนี','ซุนดา','ซูริเกานอน','ซูโอย','เซดัง','เซนทัง','เซนายา','เซบัวโน','เซไม','เซลติเบเรีย','เซอร์เบีย','เซียง','โซ','โซ่','โซตุง','โซมาเลีย','ไซซิยัต','ไซเทีย','ไซเฟ','ไซวา','ญัฮกุ้ร','ญาเฮือน','ญี่ปุ่น','ดัตช์','ดันกัน','ดัวโน','ด๊ากกัง','ดาเนา','ดาเมลี','ดารี','ดาไอ','เดนมาร์ก','โดกรี','โดมาอากี','ต้ง','ต้งเซี่ยง','ตอว์','ตรีว','ตองกา','ตองงา','ตะเรง','ตะเลียง','ตะโอย','ตัต','ตันกัต','ตัวเซ','ตากาล็อก','ตากัว','ตาเซ','ตาตาร์','ตาตาร์ไครเมีย','ตาร์คุม','ตามัง','ต่าย','ตาลิซ','ตำปวน','ตีนา','ตุรกี','ตุรกีกากาอุซบอลข่าน','ตูกัง เบซี','ตูตอง','ตูโรโย','ตูลู','ตูวัน','เตดิม','เตตัวนี','เตตุม','เตเมียน','เตรกามี','เตลูกู','เตา','เตาซุก','เตอร์กิกโบราณ','เติร์กโคราซานี','เติร์กเมน','เตรียง','ไตคัง','ไต่ซาปา','ไตโด','ไต่ตัก','ไตทัญ','ไตบอย','ไตเมเน','ไตลอง','ไต้หวัน','โตโจเดเด','โตดระห์','โตดา','โตชาเรียน','โตเบโล','โตฟา','ทซัต','ทมิฬ','ทวาย','ทอกพิซิน','ทักขินี','ทาจิก','ทาโด','ทามูดิก','ทิเบต','ทูลาว','ทูลุง','เท','ไทขาว','ไทเขิน','ไทคำตี่','ไทโซ่ง','ไทญ้อ','ไทดำ','ไทแดง','ไทเปา','ไทลอย','ไทลื้อ','ไทใต้คง','ไทหย่า','ไทใหญ่','ไทอาหม','ไทฮ่างตง','โท','โทคิโพนา','โทรจัน','นัรพู','นาซิ','นาไน','นาอานิก','นาอูรู','นาฮารี','นุง','เนปาล','เนเดบัง','เนวารี','โนไก','บราฮุย','บรู','บรูตะวันตก','บอ','บันติก','บันยูมาซัน','บัลแกเรีย','บัลติ','บัซการ์ดี','บัตส์','บัสกีร์','บาซาย','บาเตก','บ้าบ๋า','บาบูซะห์','บาราบา','บาลี','บาโลชิ','บาหลี','บาฮิง','บิโกล','บิซาโกล','บิต','บิสลามา','บีซู','บูกิส','บูโครี','บูเดะห์ สเตียง','บูตัวนอน','บูนัก','บูนัน','บูรุศซัสกี','บูร์ยัต','บูโล สเตียง','บูฮิด','เบงกาลี','เบตาวี','เบลฮาเร','เบอไลต์','แบกเทรีย','โบโด','โบโตลัน','โบลิเนา','สลาโวนิกคริสตจักรโบราณ','โบโฮลาโน','ไบมา','ปนันตะวันออก','ปยู','ปรากฤต','ปลัง','ปวก','ปะหล่องชเว','ปะหล่องรูไม','ปัญจาบ','ปันตาร์ตะวันตก','ป่า','ปาโกะห์','ปางาซินัน','ปาซายี','ปาดี','ปาลา','ปาลูลา','ปาเล ปะหล่อง','ปาเฮ็ง','ปูโก','ปูนิก','ปูมา','ปูยี','เปเชเนก','เปอร์เซีย','เปอร์เซียกลาง','เปอร์เซียโบราณ','เปียร์','โปรตุเกส','โปโรฮานอน','โปแลนด์','ไป๋','ไปวัน','โปว์','ผู้น้อย','พนา','พม่า','พระเวท','พรัช','พวน','พอง-เคนียง','พังคัว','พาครี','พาเซนด์','พาชตู','พาร์เทียน','พิซิเดีย','พิศนุปริยะ มณีปุรี','พูลา','ฝรั่งเศส','ฟรีเจีย','ฟาตาลูกู','ฟาลัม','ฟินิเชีย','ฟิลิปิโน','ฟิลิสไตน์','ฟุยุ-คีร์กิซ','เฟือง','แฟโร','ภิล','โภชปุรี','มคธี','ม้ง','ม้งชัว','ม้งดอน','ม้งโด','มณีปุรี','มนอง','มปี','มราฐี','มราบรี','มรู','มโร','มลาโซ','มลาเนากลาง','มลายู','มลายูถิ่นสตูล','มลายูปัตตานี','มลายูบรูไน','มหาราษฏรี','ม๊อก','มอกซาน','มองเกอร์','มองโกลคามนิกัน','มองโกเลีย','มอญ','มอแกน','มอเกลน','มอนอม','มะห์เมอรี','มักอันซี','มักอินดี','มัง','มันซี','มันดาอิก','มันเดกัน','มัมไบ','มัล ปาฮาเรีย','มัลดีฟส์','มัลวี','มัวไบต์','มัสบาเต','มากัสซาร์','มากาแซ','มากินดาเนา','มาคัร','มาซันดารานี','มาดูรา','มาร์วารี','มารา','มาราติ','มาราเนา','มาริ','มารีเวเลโญ','มาลากาซี','มาลายาลัม','มาเล็ง','มาห์ล','มาเลเซีย','มินทิล','มินริก','มินังกาเบา','มิยาโกะ','มึน','มุนจี','มุนดารี','มูเซอดำ','เมนเด','เม็นตาไว','ไมไต','เมวารี','เมารี','เมห์รี','เมเกรเลีย','เมเดีย','เมโมนี','เมเอ็น','เมี่ยน','แมนจู','ไมโซ','ไมถิลี','โมโคล','ยรุ','ยอง','ยะห์ฮุต','ยักโนบี','ยังเบีย','ยัซกุลยาม','ยากุน','ยาวา','ยาวี','ยาเอยามะ','ยิ','ยิงลิช','ยิดดิช','ยินเชีย','ยิวซิราซี','ยิวเยเมน','ยิวอราโกนีส','ยูการิติก','ยูกุรตะวันออก','ยูเครน','ยูราร์เทีย','ยูฮูรี','เยชิวิช','เยวานิก','เยอ','เยอรมัน','เยไฮ','เย้า','แย็ฮ','โยนากูนิ','โย้ย','รัลเต','รัสเซีย','ราชพังสี','ราชสถาน','ราเด','ราตักนอน','ราวาง','ริปัวเรียน','เรเงา','เรียง','โรกลายใต้','โรกลายเหนือ','โรมาเนีย','โรมัม','โรฮีนจา','ลอมบาร์ดิก','ละติน','ละมาม','ละเม็ต','ละว้า','ละวี','ละเว็น','ลัก','ลันนัง','ลัมกัง','ลัวะ','ลากี','ลาคู','ลาชิ','ลาดัก','ลาดิโน','ลาซ','ล้านนา','ลาโนะห์','ลาว','ลาเว','ลาฮา','ลาฮู','ลาฮูเหลือง','ลิซาน ดิดัน','ลิซานา เดนี','ลิซานิด โนซาน','ลิซู','ลิมบู','ลีซอ','ลุน บาวัง','ลูรี','ลูเวีย','เลสกี','เลปชา','เลาโว','ไลเซีย','ไลเดีย','โลทา','วันจี','วัมบูเล','ว้า','วากดิ','วาคี','วาซิรี','วาซิ-วารี','วาฟซิ','วาไร-วาไร','เวตาร์','เวียดนาม','เศรปา','สมราย','สวาฮีลี','สวีเดน','สเปน','สวาน','สะกอม','สันเกถิ','สันตาลี','สันสกฤต','สำเร','สิกขิม','สิงหล','สินธี','สิไรกิ','สิลา','สิเลฏี','สุมัสติ','สุเมเรีย','สุ่ย','เสขวาตี','เสา','เสาราษฏร์','แสก','โสก','โสรา','หริยนวี','หมิ่น','หมิ่นกลาง','หมิ่นตะวันออก','หมิ่นใต้','หมิ่นเหนือ','เหมื่อง','หยูก','หวู่','องามี','อตายัล','อนัล','อบาซา','อราเมอิก','อราเมอิกใหม่','อราเมอิกใหม่คัลเดีย','อราเมอิกใหม่ตะวันตก','อราเมอิกใหม่โบห์ตัน','อราเมอิกใหม่ยิวบาร์ซานี','อราเมอิกใหม่อัสซีเรีย','อลานิก','อวาธี','ออนฮัน','ออลลารี','ออสเซติก','อโตนี','อโมไรต์','อะชาง','อะดืยเก','อะมะมิ','อเวสตะ','อัคคาเดีย','อังกฤ','อังกฤษอย่างง่าย','อังคิกา','อัฟซาร์','อัมบาลา','อัมโมไนต์','อัลไต','อัสกุนุ','อัสเตียนี','อัสสัม','อากลานอน','อาข่า','อาคู','อาเจะห์','อาซี','อาเซอรี','อานุส','อาเบลเลน','อาร์มีเนีย','อายนี','อายมัก','อาเร็ม','อาลัก','อาหรับ','อิงกุซ','อิตาลี','อินโดนีเซีย','อินตา','อิร','อิสกาซมี','อีโดไมต์','อีบัน','อีบานัก','อีบายยานอน','อีลาไมต์','อีโลกาโน','อีวาตัน','อีเวนก์','อุซเบก','อุดเมิร์ธ','อุยกูร์','อุลช์','อูดี','อูเดเค','อูบึก','อูรดูUrdu','อูรักลาโอ้ย','เอ็น','เอ็บลาไอต์','เอสเปรันโต','เอิร์สยา','เอ้อซู','เอา','แอลเบเนีย','ไอนุ','โอะกินะวะ','โอจิบเว','โอง','โอดู','โอย','โอรัง เซเลอตัร','โอริยา','ฮปอน','ฮมาร์','ฮรังโกล','ฮลัง ดวน','ฮ้อ','ฮั่น','ฮัตติก','ฮัลบี','ฮะรัก','ฮากกา','ฮากา','ฮาเกเตีย','ฮาชอง','ฮาซารากี','ฮาไซติก','ฮานี','ฮานูโนโอ','ฮารอย','ฮารัวตี','ฮาลัง','ฮิตไตต์','ฮินดี','ฮิลิไกนอน','ฮีบรู','ฮีบรูมิซราฮี','ฮุง','ฮูร์เรีย','ฮูลัวลา','ฮเร','เฮอร์เตวิน','โฮ'] 
checkout = 0
letsend = 0

if '#$' in message and status == 0:
    tmpo = message.replace('#$','')
    line_bot_api.push_message(groupdelc, TextSendMessage(tmpo))
    status = 1
if '!@PUSH' in message and status == 0:
    result = 'สวัสดีค่ะ ขออนุญาตแจ้งวัตถุประสงค์ และกติกาการจัดตั้งไลน์นี้จากข้อความข้างต้น\n1.เพื่อเป็นศูนย์กลางในการส่งข้อมูลเกี่ยวกับตารางเวลาเรียน เวลาเรียนและอาจารย์ให้กับนักเรียน\n2. สนับสนุนส่งเสริมให้ความรู้เรื่องการเรียนรู้ภาษาอังกฤษและภาษาอื่นๆ ให้กับสมาชิก\n3. งดส่งสติ๊กเกอร์ ข้อความ รูปภาพ ลิงค์ ที่ไม่เหมาะสม อนุญาตให้เฉพาะ\n*”การถามตอบเกี่ยวกับการเรียนการสอนที่ศูนย์ภาษาเดลซีเท่านั้น”*\n\n*** หมายเหตุ ท่านใดที่ทำผิดกติกาข้างต้นเกิน2ครั้ง ทีมแอดมินจะขออนุญาตลบออกจากกลุ่มทันทีค่ะ\n\nขออนุญาตแนะนำ ทีมงานAdmin ดังนี้\n-Pm_monchai\n-June\n-Tassapooh\n\n อนุโมทนาบุญด้วยค่ะ _/\_'
    line_bot_api.push_message(groupdelc, TextSendMessage(result))
    status = 1
if status == 0:
	checkout = 0
	for tmp in share:
		if tmp in message:
			checkout = 1
			
if '!ann' in message and status == 0:
    checker = 1
    tmpo = message.replace('!ann','')
    with open("userId.txt") as f:
        for line in f:
            if checker%1001 == 0:
                time.sleep(61)
            stringofuser = line.replace('\n','')
            goout = str(stringofuser)
            #print(goout)
            if goout :
                line_bot_api.push_message(goout, TextSendMessage(tmpo))
                checker = checker +1
    status = 1

if status == 0 and checkout == 1:
	letsend = 0
	for tmp in musthave :
		if tmp in message:
			letsend = 1
			

if status == 0 and letsend == 0 and checkout == 1:
	result = 'สวัสดีค่ะ ขออนุญาตแจ้งวัตถุประสงค์ และกติกาการจัดตั้งไลน์นี้จากข้อความข้างต้น\n1.เพื่อเป็นศูนย์กลางในการส่งข้อมูลเกี่ยวกับตารางเวลาเรียน เวลาเรียนและอาจารย์ให้กับนักเรียน\n2. สนับสนุนส่งเสริมให้ความรู้เรื่องการเรียนรู้ภาษาอังกฤษและภาษาอื่นๆ ให้กับสมาชิก\n3. งดส่งสติ๊กเกอร์ ข้อความ รูปภาพ ลิงค์ ที่ไม่เหมาะสม อนุญาตให้เฉพาะ\n*”การถามตอบเกี่ยวกับการเรียนการสอนที่ศูนย์ภาษาเดลซีเท่านั้น”*\n\n*** หมายเหตุ ท่านใดที่ทำผิดกติกาข้างต้นเกิน2ครั้ง ทีมแอดมินจะขออนุญาตลบออกจากกลุ่มทันทีค่ะ\n\nขออนุญาตแนะนำ ทีมงานAdmin ดังนี้\n-Pm_monchai\n-June\n-Tassapooh\n\n อนุโมทนาบุญด้วยค่ะ _/\_'
	print ('%s' % result)
#print(checkout)
#print(letsend)
	
